<a href="https://colab.research.google.com/github/julioreis-dev/tutorial_pandas/blob/main/Seaborn_and_Linear_Regression_(start).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Introduction

Do higher film budgets lead to more box office revenue? Let's find out if there's a relationship using the movie budgets and financial performance data that I've scraped from [the-numbers.com](https://www.the-numbers.com/movie/budgets) on **May 1st, 2018**. 

<img src=https://i.imgur.com/kq7hrEh.png>

# Import Statements

In [1]:
import pandas as pd
import matplotlib.pyplot as plt

# Notebook Presentation

In [2]:
pd.options.display.float_format = '{:,.2f}'.format

from pandas.plotting import register_matplotlib_converters
register_matplotlib_converters()

# Read the Data

In [3]:
data = pd.read_csv('cost_revenue_dirty.csv')

# Explore and Clean the Data

**Challenge**: Answer these questions about the dataset:
1. How many rows and columns does the dataset contain?
2. Are there any NaN values present?
3. Are there any duplicate rows?
4. What are the data types of the columns?

In [4]:
data.shape

(5391, 6)

In [5]:
data.head()

   Rank Release_Date  ... USD_Worldwide_Gross USD_Domestic_Gross
0  5293     8/2/1915  ...         $11,000,000        $10,000,000
1  5140     5/9/1916  ...                  $0                 $0
2  5230   12/24/1916  ...          $8,000,000         $8,000,000
3  5299    9/17/1920  ...          $3,000,000         $3,000,000
4  5222     1/1/1925  ...         $22,000,000        $11,000,000

[5 rows x 6 columns]

In [6]:
data.tail()

      Rank Release_Date  ... USD_Worldwide_Gross USD_Domestic_Gross
5386  2950    10/8/2018  ...                  $0                 $0
5387   126   12/18/2018  ...                  $0                 $0
5388    96   12/31/2020  ...                  $0                 $0
5389  1119   12/31/2020  ...                  $0                 $0
5390  2517   12/31/2020  ...                  $0                 $0

[5 rows x 6 columns]

In [7]:
data.isna().values.any()

False

In [8]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5391 entries, 0 to 5390
Data columns (total 6 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Rank                   5391 non-null   int64
 1   Release_Date           5391 non-null   object
 2   Movie_Title            5391 non-null   object
 3   USD_Production_Budget  5391 non-null   object
 4   USD_Worldwide_Gross    5391 non-null   object
 5   USD_Domestic_Gross     5391 non-null   object
dtypes: int64(1), object(5)
memory usage: 252.8+ KB

In [10]:
data.sample()

      Rank Release_Date  ... USD_Worldwide_Gross USD_Domestic_Gross
2524  1954    10/6/2005  ...         $13,174,426        $12,834,849

[1 rows x 6 columns]

In [11]:
data.duplicated().values.any()

False

### Data Type Conversions

**Challenge**: Convert the `USD_Production_Budget`, `USD_Worldwide_Gross`, and `USD_Domestic_Gross` columns to a numeric format by removing `$` signs and `,`. 
<br>
<br>
Note that *domestic* in this context refers to the United States.

In [12]:
data.columns

Index(['Rank', 'Release_Date', 'Movie_Title', 'USD_Production_Budget',
       'USD_Worldwide_Gross', 'USD_Domestic_Gross'],
      dtype='object')

In [13]:
data.USD_Production_Budget = data.USD_Production_Budget.str.replace('$', '')
data.USD_Production_Budget = data.USD_Production_Budget.str.replace(',', '')
data.USD_Production_Budget = pd.to_numeric(data.USD_Production_Budget)

In [14]:
data.USD_Worldwide_Gross = data.USD_Worldwide_Gross.str.replace('$', '')
data.USD_Worldwide_Gross = data.USD_Worldwide_Gross.str.replace(',', '')
data.USD_Worldwide_Gross = pd.to_numeric(data.USD_Worldwide_Gross)

In [15]:
data.USD_Domestic_Gross = data.USD_Domestic_Gross.str.replace('$','')
data.USD_Domestic_Gross = data.USD_Domestic_Gross.str.replace(',', '')
data.USD_Domestic_Gross = pd.to_numeric(data.USD_Domestic_Gross)

In [16]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5391 entries, 0 to 5390
Data columns (total 6 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Rank                   5391 non-null   int64
 1   Release_Date           5391 non-null   object
 2   Movie_Title            5391 non-null   object
 3   USD_Production_Budget  5391 non-null   int64
 4   USD_Worldwide_Gross    5391 non-null   int64
 5   USD_Domestic_Gross     5391 non-null   int64
dtypes: int64(4), object(2)
memory usage: 252.8+ KB

**Challenge**: Convert the `Release_Date` column to a Pandas Datetime type.

In [17]:
data.Release_Date = pd.to_datetime(data.Release_Date)

In [18]:
type(data.Release_Date[0])

pandas._libs.tslibs.timestamps.Timestamp

In [19]:
data.Release_Date.head()

0   1915-08-02
1   1916-05-09
2   1916-12-24
3   1920-09-17
4   1925-01-01
Name: Release_Date, dtype: datetime64[ns]

In [20]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5391 entries, 0 to 5390
Data columns (total 6 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Rank                   5391 non-null   int64
 1   Release_Date           5391 non-null   datetime64[ns]
 2   Movie_Title            5391 non-null   object
 3   USD_Production_Budget  5391 non-null   int64
 4   USD_Worldwide_Gross    5391 non-null   int64
 5   USD_Domestic_Gross     5391 non-null   int64
dtypes: datetime64[ns](1), int64(4), object(1)
memory usage: 252.8+ KB

In [21]:
data.head()

   Rank Release_Date  ... USD_Worldwide_Gross  USD_Domestic_Gross
0  5293   1915-08-02  ...            11000000            10000000
1  5140   1916-05-09  ...                   0                   0
2  5230   1916-12-24  ...             8000000             8000000
3  5299   1920-09-17  ...             3000000             3000000
4  5222   1925-01-01  ...            22000000            11000000

[5 rows x 6 columns]

### Descriptive Statistics

**Challenge**: 

1. What is the average production budget of the films in the data set?
2. What is the average worldwide gross revenue of films?
3. What were the minimums for worldwide and domestic revenue?
4. Are the bottom 25% of films actually profitable or do they lose money?
5. What are the highest production budget and highest worldwide gross revenue of any film?
6. How much revenue did the lowest and highest budget films make?

In [22]:
data.USD_Production_Budget.describe()

count         5,391.00
mean     31,113,737.58
std      40,523,796.88
min           1,100.00
25%       5,000,000.00
50%      17,000,000.00
75%      40,000,000.00
max     425,000,000.00
Name: USD_Production_Budget, dtype: float64

In [23]:
data.USD_Production_Budget.mean()

31113737.57837136

In [24]:
data.USD_Worldwide_Gross.describe()

count           5,391.00
mean       88,855,421.96
std       168,457,757.00
min                 0.00
25%         3,865,206.00
50%        27,450,453.00
75%        96,454,455.00
max     2,783,918,982.00
Name: USD_Worldwide_Gross, dtype: float64

In [25]:
data.USD_Worldwide_Gross.mean()

88855421.96271564

In [26]:
data.USD_Worldwide_Gross.min()

0

In [27]:
data.USD_Domestic_Gross.min()

0

In [28]:
data.describe()

          Rank  USD_Production_Budget  USD_Worldwide_Gross  USD_Domestic_Gross
count 5,391.00               5,391.00             5,391.00            5,391.00
mean  2,696.00          31,113,737.58        88,855,421.96       41,235,519.44
std   1,556.39          40,523,796.88       168,457,757.00       66,029,346.27
min       1.00               1,100.00                 0.00                0.00
25%   1,348.50           5,000,000.00         3,865,206.00        1,330,901.50
50%   2,696.00          17,000,000.00        27,450,453.00       17,192,205.00
75%   4,043.50          40,000,000.00        96,454,455.00       52,343,687.00
max   5,391.00         425,000,000.00     2,783,918,982.00      936,662,225.00

In [29]:
data[data.USD_Production_Budget == 1100.00]

      Rank Release_Date  ... USD_Worldwide_Gross  USD_Domestic_Gross
2427  5391   2005-05-08  ...              181041              181041

[1 rows x 6 columns]

In [30]:
data[data.USD_Production_Budget == 425000000.00]

      Rank Release_Date  ... USD_Worldwide_Gross  USD_Domestic_Gross
3529     1   2009-12-18  ...          2783918982           760507625

[1 rows x 6 columns]

# Investigating the Zero Revenue Films

**Challenge** How many films grossed $0 domestically (i.e., in the United States)? What were the highest budget films that grossed nothing?

In [31]:
data.describe()

          Rank  USD_Production_Budget  USD_Worldwide_Gross  USD_Domestic_Gross
count 5,391.00               5,391.00             5,391.00            5,391.00
mean  2,696.00          31,113,737.58        88,855,421.96       41,235,519.44
std   1,556.39          40,523,796.88       168,457,757.00       66,029,346.27
min       1.00               1,100.00                 0.00                0.00
25%   1,348.50           5,000,000.00         3,865,206.00        1,330,901.50
50%   2,696.00          17,000,000.00        27,450,453.00       17,192,205.00
75%   4,043.50          40,000,000.00        96,454,455.00       52,343,687.00
max   5,391.00         425,000,000.00     2,783,918,982.00      936,662,225.00

In [32]:
zero_domestic = data[data.USD_Domestic_Gross == 0]

In [33]:
zero_domestic.shape

(512, 6)

In [34]:
zero_domestic.shape[0]

512

In [35]:
len(zero_domestic)

512

In [36]:
zero_domestic.sort_values('USD_Production_Budget', ascending=False)

      Rank Release_Date  ... USD_Worldwide_Gross  USD_Domestic_Gross
5388    96   2020-12-31  ...                   0                   0
5387   126   2018-12-18  ...                   0                   0
5384   321   2018-09-03  ...                   0                   0
5385   366   2018-10-08  ...                   0                   0
5090   556   2015-12-31  ...             4547660                   0
...    ...          ...  ...                 ...                 ...
4787  5371   2014-12-31  ...                   0                   0
3056  5374   2007-12-31  ...                   0                   0
4907  5381   2015-05-19  ...                   0                   0
5006  5389   2015-09-29  ...                   0                   0
5007  5390   2015-09-29  ...                   0                   0

[512 rows x 6 columns]

**Challenge**: How many films grossed $0 worldwide? What are the highest budget films that had no revenue internationally?

In [37]:
zero_worldwide = data[data.USD_Worldwide_Gross == 0]

In [38]:
zero_worldwide.head()

    Rank Release_Date  ... USD_Worldwide_Gross  USD_Domestic_Gross
1   5140   1916-05-09  ...                   0                   0
6   4630   1927-12-08  ...                   0                   0
8   4240   1930-01-01  ...                   0                   0
17  4814   1936-10-20  ...                   0                   0
27  4789   1941-10-28  ...                   0                   0

[5 rows x 6 columns]

In [39]:
zero_worldwide.shape[0]

357

In [40]:
zero_worldwide.sort_values('USD_Production_Budget', ascending=False)

      Rank Release_Date  ... USD_Worldwide_Gross  USD_Domestic_Gross
5388    96   2020-12-31  ...                   0                   0
5387   126   2018-12-18  ...                   0                   0
5384   321   2018-09-03  ...                   0                   0
5385   366   2018-10-08  ...                   0                   0
5058   880   2015-11-12  ...                   0                   0
...    ...          ...  ...                 ...                 ...
4787  5371   2014-12-31  ...                   0                   0
3056  5374   2007-12-31  ...                   0                   0
4907  5381   2015-05-19  ...                   0                   0
5006  5389   2015-09-29  ...                   0                   0
5007  5390   2015-09-29  ...                   0                   0

[357 rows x 6 columns]

In [41]:
zero_worldwide.describe()

          Rank  USD_Production_Budget  USD_Worldwide_Gross  USD_Domestic_Gross
count   357.00                 357.00               357.00              357.00
mean  4,444.68           5,815,404.99                 0.00                0.00
std     995.70          16,262,169.21                 0.00                0.00
min      96.00               1,400.00                 0.00                0.00
25%   4,148.00             500,000.00                 0.00                0.00
50%   4,751.00           1,500,000.00                 0.00                0.00
75%   5,108.00           4,400,000.00                 0.00                0.00
max   5,390.00         175,000,000.00                 0.00                0.00

### Filtering on Multiple Conditions

In [42]:
international_release = data.loc[(data.USD_Domestic_Gross == 0) & (data.USD_Worldwide_Gross !=0)]
international_release.head()

      Rank Release_Date  ... USD_Worldwide_Gross  USD_Domestic_Gross
71    4310   1956-02-16  ...                3220                   0
1579  5087   2001-02-11  ...                7890                   0
1744  3695   2001-12-31  ...            10834406                   0
2155  4236   2003-12-31  ...               63180                   0
2203  2513   2004-03-31  ...             5918742                   0

[5 rows x 6 columns]

**Challenge**: Use the [`.query()` function](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.query.html) to accomplish the same thing. Create a subset for international releases that had some worldwide gross revenue, but made zero revenue in the United States. 

Hint: This time you'll have to use the `and` keyword.

In [46]:
international_release2 = data.query('USD_Domestic_Gross == 0 & USD_Worldwide_Gross !=0')
international_release2.head()

      Rank Release_Date  ... USD_Worldwide_Gross  USD_Domestic_Gross
71    4310   1956-02-16  ...                3220                   0
1579  5087   2001-02-11  ...                7890                   0
1744  3695   2001-12-31  ...            10834406                   0
2155  4236   2003-12-31  ...               63180                   0
2203  2513   2004-03-31  ...             5918742                   0

[5 rows x 6 columns]

In [48]:
international_release2.shape[0]

155

In [49]:
print(len(international_release2))

155

### Unreleased Films

**Challenge**:
* Identify which films were not released yet as of the time of data collection (May 1st, 2018).
* How many films are included in the dataset that have not yet had a chance to be screened in the box office?
* Create another DataFrame called data_clean that does not include these films.

In [52]:
# Date of Data Collection
scrape_date = pd.Timestamp('2018-5-1')

In [57]:
future_releases = data[data.Release_Date >= scrape_date]
future_releases

      Rank Release_Date  ... USD_Worldwide_Gross  USD_Domestic_Gross
5384   321   2018-09-03  ...                   0                   0
5385   366   2018-10-08  ...                   0                   0
5386  2950   2018-10-08  ...                   0                   0
5387   126   2018-12-18  ...                   0                   0
5388    96   2020-12-31  ...                   0                   0
5389  1119   2020-12-31  ...                   0                   0
5390  2517   2020-12-31  ...                   0                   0

[7 rows x 6 columns]

In [59]:
print(f'The number of not released Films movies: {future_releases.shape[0]}')

The number of not released Films movies: 7

### Films that Lost Money

**Challenge**: 
What is the percentage of films where the production costs exceeded the worldwide gross revenue?

# Seaborn for Data Viz: Bubble Charts

### Plotting Movie Releases over Time

**Challenge**: Try to create the following Bubble Chart:

<img src=https://i.imgur.com/8fUn9T6.png>

# Converting Years to Decades Trick

**Challenge**: Create a column in `data_clean` that has the decade of the release. 

<img src=https://i.imgur.com/0VEfagw.png width=650> 

Here's how: 
1. Create a [`DatetimeIndex` object](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DatetimeIndex.html) from the Release_Date column. 
2. Grab all the years from the `DatetimeIndex` object using the `.year` property.
<img src=https://i.imgur.com/5m06Ach.png width=650>
3. Use floor division `//` to convert the year data to the decades of the films.
4. Add the decades as a `Decade` column to the `data_clean` DataFrame.

### Separate the "old" (before 1969) and "New" (1970s onwards) Films

**Challenge**: Create two new DataFrames: `old_films` and `new_films`
* `old_films` should include all the films before 1969 (up to and including 1969)
* `new_films` should include all the films from 1970 onwards
* How many films were released prior to 1970?
* What was the most expensive film made prior to 1970?

# Seaborn Regression Plots

**Challenge**: Use Seaborn's `.regplot()` to show the scatter plot and linear regression line against the `new_films`. 
<br>
<br>
Style the chart

* Put the chart on a `'darkgrid'`.
* Set limits on the axes so that they don't show negative values.
* Label the axes on the plot "Revenue in \$ billions" and "Budget in \$ millions".
* Provide HEX colour codes for the plot and the regression line. Make the dots dark blue (#2f4b7c) and the line orange (#ff7c43).

Interpret the chart

* Do our data points for the new films align better or worse with the linear regression than for our older films?
* Roughly how much would a film with a budget of $150 million make according to the regression line?

# Run Your Own Regression with scikit-learn

$$ REV \hat ENUE = \theta _0 + \theta _1 BUDGET$$

**Challenge**: Run a linear regression for the `old_films`. Calculate the intercept, slope and r-squared. How much of the variance in movie revenue does the linear model explain in this case?

# Use Your Model to Make a Prediction

We just estimated the slope and intercept! Remember that our Linear Model has the following form:

$$ REV \hat ENUE = \theta _0 + \theta _1 BUDGET$$

**Challenge**:  How much global revenue does our model estimate for a film with a budget of $350 million?